app/Controllers/Aliments.php

    public function index()
    {
        if ($redirect = $this->requireLogin()) {
            return $redirect;
        }

        $userId = (int) $this->currentUser['id'];
        $profil = (new ProfilSanteModel())->findByUserId($userId);
        $objectifId = $profil['objectif_id'] ?? null;

        $aliments = (new AlimentModel())->getForObjectif($objectifId ? (int) $objectifId : null);

        $objectifMap = [];
        foreach ((new ObjectifModel())->findAll() as $objectif) {
---
SELECT *
FROM `objectifs`