app/Controllers/Auth.php

        $userId = (int) $userModel->getInsertID();
        $imc = $taille > 0 ? $poids / pow($taille / 100, 2) : null;

        (new ProfilSanteModel())->insert([
            'user_id' => $userId,
            'taille_cm' => $taille,
            'poids_kg' => $poids,
            'objectif_id' => $objectifId,
            'imc' => $imc !== null ? round($imc, 2) : null,
        ]);

        (new PortefeuilleModel())->insert([
            'user_id' => $userId,
            'solde' => 0,
        ]);
---
INSERT INTO `profil_sante` (`user_id`, `taille_cm`, `poids_kg`, `objectif_id`, `imc`, `created_at`, `updated_at`) VALUES (1, 176, 81, 2, 26.15, '2026-05-10 21:25:08', '2026-05-10 21:25:08')
INSERT INTO `portefeuilles` (`user_id`, `solde`, `created_at`, `updated_at`) VALUES (1, 0, '2026-05-10 21:25:08', '2026-05-10 21:25:08')