app/Controllers/ExportProgramme.php

SELECT *
FROM `objectifs`
WHERE `objectifs`.`id` = 2
---
    public function index()
    {
        if ($redirect = $this->requireLogin()) {
            return $redirect;
        }

        $userId = (int) $this->currentUser['id'];
        $user = (new UserModel())->find($userId);
        $profil = (new ProfilSanteModel())->findByUserId($userId);
        $objectif = null;
        if ($profil && $profil['objectif_id']) {
            $objectif = (new ObjectifModel())->find((int) $profil['objectif_id']);