app/Controllers/Livres.php

    public function show(int $id)
    {
        $livreModel = new LivreModel();
        $empruntModel = new EmpruntModel();

        $livre = $livreModel->find($id);
---
SELECT *
FROM `livres`
WHERE `livres`.`id` = 37