app/Controllers/Portefeuille.php

SELECT *
FROM `paiements`
WHERE `user_id` = 7
ORDER BY `id` DESC
 LIMIT 15
---
    public function index()
    {
        if ($redirect = $this->requireLogin()) {
            return $redirect;
        }

        $userId = (int) $this->currentUser['id'];
        $portefeuilleModel = new PortefeuilleModel();
        $portefeuille = $portefeuilleModel->getByUserId($userId);
        if (! $portefeuille) {
            $portefeuilleModel->insert([
                'user_id' => $userId,
                'solde' => 0,
            ]);
            $portefeuille = $portefeuilleModel->getByUserId($userId);
        }

        $paiements = (new PaiementModel())
            ->where('user_id', $userId)
            ->orderBy('id', 'DESC')
            ->findAll(15);