app/Controllers/Profil.php

SELECT *
FROM `sexes`
ORDER BY `label`
SELECT *
FROM `objectifs`
ORDER BY `label`
---
    public function index()
    {
        if ($redirect = $this->requireLogin()) {
            return $redirect;
        }

        $userId = (int) $this->currentUser['id'];
        $userModel = new UserModel();
        $profilModel = new ProfilSanteModel();

        $user = $userModel->find($userId);
        $profil = $profilModel->findByUserId($userId);

        return $this->render('profil/index', [
            'title' => 'Profil',
            'user' => $user,
            'profil' => $profil,
            'sexes' => (new SexeModel())->orderBy('label')->findAll(),
            'objectifs' => (new ObjectifModel())->orderBy('label')->findAll(),

UPDATE `profil_sante` SET `taille_cm` = 176, `poids_kg` = 81, `objectif_id` = 2, `imc` = 26.15, `updated_at` = '2026-05-11 08:10:10'
WHERE `user_id` = 1
---
        ]);

        $imc = $taille > 0 ? $poids / pow($taille / 100, 2) : null;
        (new ProfilSanteModel())
            ->where('user_id', $userId)
            ->set([
                'taille_cm' => $taille,
                'poids_kg' => $poids,
                'objectif_id' => $objectifId,
                'imc' => $imc !== null ? round($imc, 2) : null,
            ])
            ->update();