app/Controllers/Regimes.php

SELECT *
FROM `objectifs`
---
    public function index()
    {
        if ($redirect = $this->requireLogin()) {
            return $redirect;
        }

        $userId = (int) $this->currentUser['id'];
        $profil = (new ProfilSanteModel())->findByUserId($userId);
        $objectifId = $profil['objectif_id'] ?? null;

        $regimeModel = new RegimeModel();
        $regimes = $regimeModel->getForObjectif($objectifId ? (int) $objectifId : null);

        $suggestion = null;
        if ($regimes) {
            $suggestion = $regimes[0];
            foreach ($regimes as $regime) {
                if ((int) $regime['duree_jours'] < (int) $suggestion['duree_jours']) {
                    $suggestion = $regime;
                }
            }
        }

        $objectifMap = [];
        foreach ((new ObjectifModel())->findAll() as $objectif) {

SELECT *
FROM `regimes`
WHERE `regimes`.`id` = 3
---
    public function show(int $id)
    {
        if ($redirect = $this->requireLogin()) {
            return $redirect;
        }

        $regime = (new RegimeModel())->find($id);