app/Models/AlimentModel.php

SELECT *
FROM `aliments`
WHERE `actif` = 1
AND `objectif_id` = 3
ORDER BY `nom`
---
    public function getForObjectif(?int $objectifId): array
    {
        $builder = $this->where('actif', 1);

        if (! $objectifId) {
            return $builder->orderBy('nom')->findAll();
        }

        return $builder->where('objectif_id', $objectifId)->orderBy('nom')->findAll();