app/Models/CategorieModel.php

    public function getNoms(): array
    {
        if (! $this->tableIsReady()) {
            return [];
        }

        $rows = $this->select('nom')->orderBy('nom', 'ASC')->findAll();
---
SELECT `nom`
FROM `categories`
ORDER BY `nom` ASC