app/Models/HistoriqueRegimeModel.php

SELECT *
FROM `historique_regimes`
WHERE `user_id` = 7
AND `date_fin` >= '2026-05-11'
ORDER BY `date_debut` DESC
 LIMIT 1
---
    public function getActiveByUser(int $userId): ?array
    {
        $today = date('Y-m-d');

        return $this->where('user_id', $userId)
            ->where('date_fin >=', $today)
            ->orderBy('date_debut', 'DESC')
            ->first();