app/Models/LivreModel.php

    public function getPaginatedLivres(int $perPage = 10): array
    {
        return $this->orderBy('created_at', 'DESC')->paginate($perPage);
---
SELECT *
FROM `livres`
ORDER BY `created_at` DESC
 LIMIT 10, 10
SELECT COUNT(*) AS `numrows`
FROM `livres`