app/Models/ParametreModel.php

SELECT *
FROM `parametres`
WHERE `cle` = 'gold_discount_percent'
 LIMIT 1
---
    public function getValue(string $key, string $default = ''): string
    {
        $row = $this->where('cle', $key)->first();