app/Models/PortefeuilleModel.php

    public function getByUserId(int $userId): ?array
    {
        return $this->where('user_id', $userId)->first();
---
SELECT *
FROM `portefeuilles`
WHERE `user_id` = 1
 LIMIT 1