app/Models/ProfilSanteModel.php

SELECT *
FROM `profil_sante`
WHERE `user_id` = 7
 LIMIT 1
---
    public function findByUserId(int $userId): ?array
    {
        return $this->where('user_id', $userId)->first();