app/Models/RegimeModel.php

    public function getForObjectif(?int $objectifId): array
    {
        if (! $objectifId) {
            return $this->orderBy('nom')->findAll();
        }

        return $this->where('objectif_id', $objectifId)->orderBy('nom')->findAll();
---
SELECT *
FROM `regimes`
WHERE `objectif_id` = 2
ORDER BY `nom`